unfdemo.BS_Billing/src/Catalogs/BS_НастройкиБиллинга/BS_НастройкиБиллинга.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>BS_НастройкиБиллинга</name>
  <attributes>
    <name>Token</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОблачногоСервиса</name>
    <type>
      <types>EnumRef.BS_ВидыОблачныхСервисов1С</types>
    </type>
  </attributes>
  <attributes>
    <name>Настройки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторРегламентногоЗадания</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонСообщения</name>
    <type>
      <types>CatalogRef.ШаблоныСообщений</types>
    </type>
  </attributes>
</mdclass:Catalog>

unfdemo.BS_Billing/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="f3485b53-c447-4b51-8a87-ed842c7cd798">
  <name>ДоговорыКонтрагентов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
    <hierarchyType>Checked</hierarchyType>
    <owners>Checked</owners>
  </extension>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.Контрагенты</owners>
  <owners>Catalog.Организации</owners>
  <attributes extendedConfigurationObject="afade472-dfec-4a71-8aa5-cf756498b3e0">
    <name>ДатаДоговора</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="ba21d9ae-7af3-43e2-a28c-7690335a0360">
    <name>СрокДействия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="24b94ea0-8983-4681-8b9f-ffb0013e10c8">
    <name>ВалютаРасчетов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="df458e12-80b3-4edd-9b7e-41aa44243c15">
    <name>РасчетыВУсловныхЕдиницах</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a14f4886-8731-4ec3-bb1f-6435044f2843">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ceaaccdd-24f3-48bc-b2b8-66b76e6302fd">
    <name>ВидДоговора</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c9de6ad3-88ba-41fd-a977-a7760653786e">
    <name>ПризнакАгента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ae3cde4c-66f9-4b23-a740-5cb4d70c4a6c">
    <name>КатегорияДоговора</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4e3c829b-38bc-43bd-a1f1-d245aabc621a">
    <name>СтатьяДДСПоУмолчанию</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f7e3c221-db42-43ac-a39a-dd18281f4fbe">
    <name>СпособЗаполненияСтавкиНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c5ea0944-9f86-48aa-8c0b-bca56421d54c">
    <name>СпособРазнесенияОплатыПоУмолчанию</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="55a56dea-c90a-4dc6-bc23-b3190d807f19">
    <name>СпособЗачетаПредоплатыПоУмолчанию</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d523ad97-322c-4844-9f99-f25fa2c5c28c">
    <name>СрокОплатыПоставщику</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="dccc579a-53b7-465b-91ca-9ce930c821ad">
    <name>СрокОплатыПокупателя</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="3137eca7-6071-45f0-afe3-ffdf9416ea64">
    <name>НомерДоговора</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a105b8e0-70b4-4e29-b3e3-f3b9eb94b024">
    <name>ДоговорПодписан</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3c86062b-aa4b-43d0-adb6-2deefdcbbc6c">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="959c1196-dca8-42bb-baa2-d2c2e49b5917">
    <name>АвтоматическиВыделятьВознаграждениеВЧеке</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="81c0baf5-81c1-45fd-b7ec-cead2aef600a">
    <name>УслугаКомиссионногоВознаграждения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2bf4a786-7ee6-4084-828a-46582f1affac">
    <name>ДоговорУслугиКомиссионногоВознаграждения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="be1df036-69a0-4727-acd8-37aad00955af">
    <name>ПроцентКомиссионногоВознаграждения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="2d002863-83ca-4962-bbc4-f71873d9c526">
    <name>ВознаграждениеВключеноВСтоимость</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0bdd4ce0-1367-4d28-8d29-1a055aba9a55">
    <name>ТелефонПлатежногоАгента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>19</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="22adcd8b-88de-486f-89bc-c2e8d9d7c41c">
    <name>ТелефонОператораПоПриемуПлатежей</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>19</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="e0b65c68-0b0d-41a3-ba0b-23f44c4c2da4">
    <name>ТелефонПоставщика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>19</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="8bb5027d-a00e-4604-a168-053ed6c00978">
    <name>АдресОператораПеревода</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a5c3dcaf-b784-4790-8d6c-9a041f782257">
    <name>ТелефонОператораПеревода</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>19</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="239912d8-d641-44ca-96a7-6a110a883197">
    <name>ИННОператораПеревода</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="e189f471-67ef-446a-9a6f-3c0c69c0b690">
    <name>НаименованиеОператораПеревода</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="06c4d73d-e5d8-4c31-a59a-5ffd2e2ec137">
    <name>ОперацияПлатежногоАгента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>24</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="31748d4b-f72c-4b1f-b8ba-222106377b84">
    <name>ВидЦен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="55b82d56-d625-4698-90f4-462d3ed2c474">
    <name>ВидСкидкиНаценки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="fc7d0c9f-52b9-42de-84b2-5c6574a230be">
    <name>ВидЦенКонтрагента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f332ae5a-0120-411b-aa57-46bdd5e080b7">
    <name>АвтоматическиРегистрироватьЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b1731e4e-2144-4574-aa91-f2912e672296">
    <name>ЭтоДоговорОбслуживания</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0e42b329-6009-4fae-8e1b-b64710be17a6">
    <name>ДоговорОбслуживанияДатаНачала</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="1aa6a169-0d58-4377-805a-ff22dd905f3f">
    <name>ДоговорОбслуживанияДатаОкончания</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="3517d014-3c4b-428e-9f8c-eca6d1096831">
    <name>ДоговорОбслуживанияПериодичность</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="225e54f0-fdc6-4c40-823f-be6073e4bd46">
    <name>ДоговорОбслуживанияДнейДоВыставленияДокументов</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="02b6a2af-5ccf-4b62-a962-e624cbfd493e">
    <name>ДоговорОбслуживанияМесяцевДоВыставленияДокументов</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="acb7a520-d497-47f5-89d2-46eae9464b27">
    <name>ДоговорОбслуживанияТарифныйПлан</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="30c85f2d-6d6c-4fb7-884a-020df0c0cb07">
    <name>ДоговорОбслуживанияНаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d585c3da-30d9-4c31-a7de-e45e65e2ea68">
    <name>ЭтоДоговорЭквайринга</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="72884fa6-08b9-46b3-8be9-308032dd4d9b">
    <name>КонтрольВзаиморасчетовЭквайринг</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4f16695d-ba67-4d63-a3f2-1cdad038af70">
    <name>РасчетКомиссииВОтчетеЭквайера</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a9bee795-008e-41e3-b5d8-6c3b601046dc">
    <name>ЭтоДоговорКредита</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6e6ca3ef-5f4b-4353-a185-90f6b1d64ada">
    <name>УдержатьКомиссионноеВознаграждение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a3bc712e-d421-4baf-b86b-8e55154c10ef">
    <name>НеУчитыватьЗаказыПриПередачеНаКомиссию</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7d94d124-6fc9-4dbf-860e-8451defc712b">
    <name>СпособРасчетаКомиссионногоВознаграждения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1664fedd-9e36-490d-9b4e-91a1acbc8759">
    <name>НоменклатураДляОтраженияСуммыБезВознаграждения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ba8d50b7-7fa3-4dc5-ad63-1cf8997cb855">
    <name>УслугаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a47c90ab-9ba7-4631-8e45-213c3e8cb73f">
    <name>ПереноситьУдержанныеСуммыНаРасчетыСПоставщиком</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a1137876-5d03-4f5c-8fa3-6951b74873c4">
    <name>ДоговорСоСлужбойДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d4c885d2-5b07-4d1d-9928-256c0c415e6e">
    <name>ВариантВыбытияМаркируемойПродукции</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a85efda6-4413-40ad-9191-93295c062965">
    <name>Недействителен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>bs_СписокСервисов</name>
    <attributes>
      <name>Сервис</name>
      <type>
        <types>CatalogRef.bs_СервисыКонтрагента</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

unfdemo.BS_Billing/src/Catalogs/BS_НастройкиБиллинга/ManagerModule.bsl
#Если Сервер Или ВнешнееСоединение Тогда
	
Функция ПолучитьНастройкиПоУмолчанию() Экспорт
	
	НастройкиОбмена = Новый Структура;
		
		ДниОповещенияКонтрагентов = Новый ТаблицаЗначений;
		ДниОповещенияКонтрагентов.Колонки.Добавить("Пометка");
		ДниОповещенияКонтрагентов.Колонки.Добавить("День");
		ДниОповещенияКонтрагентов.Колонки.Добавить("Представление");
		
		СрокОплаты = ПолучитьМаксимальныйСрокОплаты();

		Для Сч = 1 по СрокОплаты Цикл

			СклонениеДень = ПользователиСлужебныйКлиентСервер.ПредметЦелогоЧисла(Сч, "НП=Истина;",
															НСтр("ru = 'день,дня,дней,,,,,,0'"));
			СтрокаТЧОповещениеКонтрагента = ДниОповещенияКонтрагентов.Добавить();
			СтрокаТЧОповещениеКонтрагента.День = Сч;
			СтрокаТЧОповещениеКонтрагента.Представление = СтрШаблон("%1 %2", Сч, СклонениеДень);
			СтрокаТЧОповещениеКонтрагента.Пометка = Ложь;
			
		КонецЦикла;

	НастройкиОбмена.Вставить("ДниОповещенияКонтрагентов", 	ДниОповещенияКонтрагентов);

	Возврат НастройкиОбмена;
	
КонецФункции

Функция ПолучитьМаксимальныйСрокОплаты()
	
	СрокОплаты = 7;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	МАКСИМУМ(ДоговорыКонтрагентов.СрокОплатыПокупателя) КАК СрокОплатыПокупателя
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.ЭтоДоговорОбслуживания = ИСТИНА";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		
		Если Выборка.Следующий() Тогда
			СрокОплаты = ?(СрокОплаты > Выборка.СрокОплатыПокупателя, СрокОплаты, Выборка.СрокОплатыПокупателя)
		КонецЕсли;
	КонецЕсли;

	Возврат СрокОплаты;
	
КонецФункции 

#КонецЕсли
